BenchmarkOutput/updates/normal_normal.txt
[OVERALL], RunTime(ms), 1087
[OVERALL], Throughput(ops/sec), 919.9632014719411
[TOTAL_GCS_PS_Scavenge], Count, 0
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 0
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.0
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 0
[TOTAL_GC_TIME], Time(ms), 0
[TOTAL_GC_TIME_%], Time(%), 0.0
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 933.0
[CLEANUP], MinLatency(us), 933
[CLEANUP], MaxLatency(us), 933
[CLEANUP], 25thPercentileLatency(us), 933
[CLEANUP], 50thPercentileLatency(us), 933
[CLEANUP], 75thPercentileLatency(us), 933
[CLEANUP], 90thPercentileLatency(us), 933
[CLEANUP], 95thPercentileLatency(us), 933
[CLEANUP], 99thPercentileLatency(us), 933
[CLEANUP], 933, 1.0
[UPDATE], Operations, 1000
[UPDATE], AverageLatency(us), 929.734
[UPDATE], MinLatency(us), 311
[UPDATE], MaxLatency(us), 377087
[UPDATE], 25thPercentileLatency(us), 430
[UPDATE], 50thPercentileLatency(us), 515
[UPDATE], 75thPercentileLatency(us), 631
[UPDATE], 90thPercentileLatency(us), 755
[UPDATE], 95thPercentileLatency(us), 847
[UPDATE], 99thPercentileLatency(us), 1452
[UPDATE], Return=OK, 1000
[UPDATE], 311, 2.0
[UPDATE], 312, 4.0
[UPDATE], 313, 5.0
[UPDATE], 314, 7.0
[UPDATE], 315, 5.0
[UPDATE], 316, 4.0
[UPDATE], 317, 4.0
[UPDATE], 318, 5.0
[UPDATE], 319, 2.0
[UPDATE], 320, 1.0
[UPDATE], 321, 3.0
[UPDATE], 322, 2.0
[UPDATE], 323, 2.0
[UPDATE], 324, 3.0
[UPDATE], 325, 4.0
[UPDATE], 326, 5.0
[UPDATE], 327, 3.0
[UPDATE], 328, 2.0
[UPDATE], 329, 4.0
[UPDATE], 330, 2.0
[UPDATE], 331, 1.0
[UPDATE], 333, 3.0
[UPDATE], 335, 2.0
[UPDATE], 336, 3.0
[UPDATE], 337, 4.0
[UPDATE], 338, 3.0
[UPDATE], 339, 2.0
[UPDATE], 340, 2.0
[UPDATE], 341, 1.0
[UPDATE], 342, 4.0
[UPDATE], 343, 1.0
[UPDATE], 344, 2.0
[UPDATE], 345, 1.0
[UPDATE], 349, 2.0
[UPDATE], 350, 2.0
[UPDATE], 351, 3.0
[UPDATE], 353, 1.0
[UPDATE], 355, 1.0
[UPDATE], 358, 1.0
[UPDATE], 359, 1.0
[UPDATE], 360, 4.0
[UPDATE], 361, 3.0
[UPDATE], 363, 1.0
[UPDATE], 364, 4.0
[UPDATE], 365, 5.0
[UPDATE], 366, 2.0
[UPDATE], 367, 2.0
[UPDATE], 369, 1.0
[UPDATE], 370, 5.0
[UPDATE], 371, 4.0
[UPDATE], 372, 2.0
[UPDATE], 373, 1.0
[UPDATE], 374, 2.0
[UPDATE], 375, 2.0
[UPDATE], 376, 1.0
[UPDATE], 377, 1.0
[UPDATE], 378, 2.0
[UPDATE], 381, 2.0
[UPDATE], 384, 2.0
[UPDATE], 385, 1.0
[UPDATE], 386, 1.0
[UPDATE], 388, 1.0
[UPDATE], 389, 3.0
[UPDATE], 391, 1.0
[UPDATE], 392, 2.0
[UPDATE], 393, 2.0
[UPDATE], 394, 1.0
[UPDATE], 395, 2.0
[UPDATE], 396, 5.0
[UPDATE], 397, 1.0
[UPDATE], 398, 2.0
[UPDATE], 399, 2.0
[UPDATE], 400, 2.0
[UPDATE], 401, 1.0
[UPDATE], 403, 1.0
[UPDATE], 404, 6.0
[UPDATE], 405, 1.0
[UPDATE], 406, 4.0
[UPDATE], 407, 8.0
[UPDATE], 408, 2.0
[UPDATE], 410, 3.0
[UPDATE], 411, 5.0
[UPDATE], 412, 4.0
[UPDATE], 413, 1.0
[UPDATE], 415, 4.0
[UPDATE], 416, 1.0
[UPDATE], 417, 2.0
[UPDATE], 418, 1.0
[UPDATE], 419, 3.0
[UPDATE], 420, 3.0
[UPDATE], 423, 3.0
[UPDATE], 424, 4.0
[UPDATE], 425, 1.0
[UPDATE], 426, 3.0
[UPDATE], 427, 1.0
[UPDATE], 428, 3.0
[UPDATE], 429, 3.0
[UPDATE], 430, 3.0
[UPDATE], 431, 6.0
[UPDATE], 432, 3.0
[UPDATE], 433, 5.0
[UPDATE], 434, 4.0
[UPDATE], 435, 4.0
[UPDATE], 436, 3.0
[UPDATE], 437, 4.0
[UPDATE], 440, 4.0
[UPDATE], 441, 1.0
[UPDATE], 442, 3.0
[UPDATE], 443, 2.0
[UPDATE], 444, 3.0
[UPDATE], 445, 5.0
[UPDATE], 446, 4.0
[UPDATE], 447, 4.0
[UPDATE], 448, 1.0
[UPDATE], 449, 4.0
[UPDATE], 450, 2.0
[UPDATE], 451, 2.0
[UPDATE], 452, 1.0
[UPDATE], 453, 3.0
[UPDATE], 454, 1.0
[UPDATE], 455, 1.0
[UPDATE], 456, 3.0
[UPDATE], 457, 4.0
[UPDATE], 458, 4.0
[UPDATE], 459, 2.0
[UPDATE], 460, 2.0
[UPDATE], 461, 5.0
[UPDATE], 462, 2.0
[UPDATE], 463, 1.0
[UPDATE], 464, 3.0
[UPDATE], 465, 5.0
[UPDATE], 466, 2.0
[UPDATE], 467, 5.0
[UPDATE], 468, 3.0
[UPDATE], 469, 1.0
[UPDATE], 470, 2.0
[UPDATE], 471, 2.0
[UPDATE], 472, 2.0
[UPDATE], 473, 3.0
[UPDATE], 474, 4.0
[UPDATE], 475, 7.0
[UPDATE], 476, 3.0
[UPDATE], 477, 6.0
[UPDATE], 478, 1.0
[UPDATE], 479, 1.0
[UPDATE], 480, 2.0
[UPDATE], 481, 6.0
[UPDATE], 482, 5.0
[UPDATE], 483, 1.0
[UPDATE], 484, 1.0
[UPDATE], 485, 4.0
[UPDATE], 486, 3.0
[UPDATE], 487, 3.0
[UPDATE], 488, 6.0
[UPDATE], 489, 2.0
[UPDATE], 490, 4.0
[UPDATE], 491, 6.0
[UPDATE], 492, 1.0
[UPDATE], 493, 4.0
[UPDATE], 494, 1.0
[UPDATE], 495, 2.0
[UPDATE], 496, 1.0
[UPDATE], 497, 1.0
[UPDATE], 498, 2.0
[UPDATE], 499, 4.0
[UPDATE], 500, 7.0
[UPDATE], 501, 3.0
[UPDATE], 502, 1.0
[UPDATE], 504, 3.0
[UPDATE], 505, 6.0
[UPDATE], 506, 2.0
[UPDATE], 507, 5.0
[UPDATE], 508, 1.0
[UPDATE], 509, 2.0
[UPDATE], 510, 5.0
[UPDATE], 511, 2.0
[UPDATE], 512, 2.0
[UPDATE], 513, 2.0
[UPDATE], 514, 4.0
[UPDATE], 515, 4.0
[UPDATE], 516, 1.0
[UPDATE], 517, 2.0
[UPDATE], 518, 1.0
[UPDATE], 519, 7.0
[UPDATE], 520, 3.0
[UPDATE], 521, 2.0
[UPDATE], 522, 3.0
[UPDATE], 523, 1.0
[UPDATE], 526, 1.0
[UPDATE], 527, 4.0
[UPDATE], 528, 1.0
[UPDATE], 529, 5.0
[UPDATE], 530, 5.0
[UPDATE], 531, 2.0
[UPDATE], 532, 2.0
[UPDATE], 533, 4.0
[UPDATE], 534, 1.0
[UPDATE], 535, 3.0
[UPDATE], 536, 2.0
[UPDATE], 537, 2.0
[UPDATE], 539, 2.0
[UPDATE], 540, 3.0
[UPDATE], 542, 1.0
[UPDATE], 543, 2.0
[UPDATE], 544, 2.0
[UPDATE], 545, 4.0
[UPDATE], 546, 1.0
[UPDATE], 548, 2.0
[UPDATE], 549, 1.0
[UPDATE], 550, 2.0
[UPDATE], 551, 3.0
[UPDATE], 552, 2.0
[UPDATE], 553, 1.0
[UPDATE], 554, 1.0
[UPDATE], 555, 2.0
[UPDATE], 556, 6.0
[UPDATE], 557, 3.0
[UPDATE], 558, 2.0
[UPDATE], 559, 1.0
[UPDATE], 560, 2.0
[UPDATE], 561, 1.0
[UPDATE], 563, 4.0
[UPDATE], 564, 1.0
[UPDATE], 565, 3.0
[UPDATE], 566, 5.0
[UPDATE], 567, 2.0
[UPDATE], 568, 2.0
[UPDATE], 569, 2.0
[UPDATE], 570, 2.0
[UPDATE], 571, 4.0
[UPDATE], 572, 4.0
[UPDATE], 573, 3.0
[UPDATE], 574, 2.0
[UPDATE], 575, 5.0
[UPDATE], 576, 3.0
[UPDATE], 577, 2.0
[UPDATE], 578, 3.0
[UPDATE], 579, 3.0
[UPDATE], 580, 4.0
[UPDATE], 581, 2.0
[UPDATE], 582, 3.0
[UPDATE], 583, 2.0
[UPDATE], 584, 2.0
[UPDATE], 585, 7.0
[UPDATE], 586, 2.0
[UPDATE], 587, 2.0
[UPDATE], 588, 3.0
[UPDATE], 589, 1.0
[UPDATE], 590, 1.0
[UPDATE], 591, 3.0
[UPDATE], 592, 1.0
[UPDATE], 593, 1.0
[UPDATE], 594, 4.0
[UPDATE], 596, 5.0
[UPDATE], 597, 5.0
[UPDATE], 598, 3.0
[UPDATE], 599, 1.0
[UPDATE], 600, 2.0
[UPDATE], 602, 2.0
[UPDATE], 604, 3.0
[UPDATE], 605, 3.0
[UPDATE], 606, 2.0
[UPDATE], 607, 2.0
[UPDATE], 611, 2.0
[UPDATE], 612, 2.0
[UPDATE], 613, 1.0
[UPDATE], 614, 1.0
[UPDATE], 615, 2.0
[UPDATE], 616, 3.0
[UPDATE], 617, 2.0
[UPDATE], 618, 1.0
[UPDATE], 619, 2.0
[UPDATE], 620, 1.0
[UPDATE], 621, 4.0
[UPDATE], 622, 1.0
[UPDATE], 623, 1.0
[UPDATE], 624, 1.0
[UPDATE], 627, 2.0
[UPDATE], 628, 5.0
[UPDATE], 629, 2.0
[UPDATE], 630, 1.0
[UPDATE], 631, 1.0
[UPDATE], 632, 1.0
[UPDATE], 633, 3.0
[UPDATE], 634, 1.0
[UPDATE], 635, 2.0
[UPDATE], 636, 3.0
[UPDATE], 637, 2.0
[UPDATE], 638, 1.0
[UPDATE], 639, 1.0
[UPDATE], 640, 5.0
[UPDATE], 642, 2.0
[UPDATE], 643, 3.0
[UPDATE], 644, 2.0
[UPDATE], 645, 3.0
[UPDATE], 647, 2.0
[UPDATE], 648, 3.0
[UPDATE], 649, 1.0
[UPDATE], 650, 2.0
[UPDATE], 652, 1.0
[UPDATE], 654, 1.0
[UPDATE], 656, 2.0
[UPDATE], 660, 1.0
[UPDATE], 661, 4.0
[UPDATE], 662, 2.0
[UPDATE], 663, 4.0
[UPDATE], 665, 1.0
[UPDATE], 666, 2.0
[UPDATE], 667, 3.0
[UPDATE], 669, 1.0
[UPDATE], 671, 1.0
[UPDATE], 674, 1.0
[UPDATE], 676, 1.0
[UPDATE], 678, 1.0
[UPDATE], 679, 1.0
[UPDATE], 681, 3.0
[UPDATE], 685, 5.0
[UPDATE], 686, 2.0
[UPDATE], 687, 4.0
[UPDATE], 688, 2.0
[UPDATE], 689, 1.0
[UPDATE], 690, 3.0
[UPDATE], 691, 1.0
[UPDATE], 692, 1.0
[UPDATE], 694, 5.0
[UPDATE], 695, 3.0
[UPDATE], 697, 3.0
[UPDATE], 698, 1.0
[UPDATE], 699, 3.0
[UPDATE], 701, 1.0
[UPDATE], 702, 2.0
[UPDATE], 704, 1.0
[UPDATE], 705, 1.0
[UPDATE], 706, 1.0
[UPDATE], 707, 1.0
[UPDATE], 708, 2.0
[UPDATE], 709, 1.0
[UPDATE], 713, 2.0
[UPDATE], 714, 2.0
[UPDATE], 717, 3.0
[UPDATE], 718, 1.0
[UPDATE], 721, 2.0
[UPDATE], 722, 1.0
[UPDATE], 723, 1.0
[UPDATE], 724, 1.0
[UPDATE], 726, 3.0
[UPDATE], 727, 2.0
[UPDATE], 728, 1.0
[UPDATE], 729, 1.0
[UPDATE], 730, 1.0
[UPDATE], 731, 1.0
[UPDATE], 733, 1.0
[UPDATE], 735, 1.0
[UPDATE], 736, 1.0
[UPDATE], 737, 2.0
[UPDATE], 742, 1.0
[UPDATE], 744, 1.0
[UPDATE], 747, 2.0
[UPDATE], 749, 2.0
[UPDATE], 750, 1.0
[UPDATE], 752, 2.0
[UPDATE], 753, 1.0
[UPDATE], 754, 1.0
[UPDATE], 755, 1.0
[UPDATE], 756, 1.0
[UPDATE], 757, 3.0
[UPDATE], 758, 1.0
[UPDATE], 759, 1.0
[UPDATE], 760, 1.0
[UPDATE], 763, 3.0
[UPDATE], 766, 1.0
[UPDATE], 768, 3.0
[UPDATE], 769, 1.0
[UPDATE], 770, 1.0
[UPDATE], 774, 3.0
[UPDATE], 775, 4.0
[UPDATE], 780, 1.0
[UPDATE], 782, 1.0
[UPDATE], 791, 1.0
[UPDATE], 797, 1.0
[UPDATE], 801, 2.0
[UPDATE], 802, 1.0
[UPDATE], 803, 1.0
[UPDATE], 804, 1.0
[UPDATE], 805, 1.0
[UPDATE], 806, 1.0
[UPDATE], 807, 2.0
[UPDATE], 815, 2.0
[UPDATE], 817, 1.0
[UPDATE], 819, 2.0
[UPDATE], 821, 1.0
[UPDATE], 825, 1.0
[UPDATE], 827, 2.0
[UPDATE], 834, 2.0
[UPDATE], 844, 1.0
[UPDATE], 846, 1.0
[UPDATE], 847, 2.0
[UPDATE], 851, 1.0
[UPDATE], 852, 1.0
[UPDATE], 855, 1.0
[UPDATE], 868, 1.0
[UPDATE], 872, 1.0
[UPDATE], 878, 1.0
[UPDATE], 891, 2.0
[UPDATE], 894, 1.0
[UPDATE], 907, 1.0
[UPDATE], 909, 1.0
[UPDATE], 913, 1.0
[UPDATE], 935, 1.0
[UPDATE], 950, 1.0
[UPDATE], 954, 2.0
[UPDATE], 971, 1.0
[UPDATE], 981, 1.0
[UPDATE], 988, 1.0
[UPDATE], 990, 1.0
[UPDATE], 999, 1.0
[UPDATE], 1000, 1.0
[UPDATE], 1031, 1.0
[UPDATE], 1059, 1.0
[UPDATE], 1070, 1.0
[UPDATE], 1080, 1.0
[UPDATE], 1128, 1.0
[UPDATE], 1132, 1.0
[UPDATE], 1133, 1.0
[UPDATE], 1166, 1.0
[UPDATE], 1180, 1.0
[UPDATE], 1181, 1.0
[UPDATE], 1206, 1.0
[UPDATE], 1258, 1.0
[UPDATE], 1282, 1.0
[UPDATE], 1293, 1.0
[UPDATE], 1318, 1.0
[UPDATE], 1366, 1.0
[UPDATE], 1452, 1.0
[UPDATE], 1490, 1.0
[UPDATE], 1538, 1.0
[UPDATE], 1639, 1.0
[UPDATE], 1651, 1.0
[UPDATE], 1675, 1.0
[UPDATE], 2157, 1.0
[UPDATE], 2167, 1.0
[UPDATE], 2181, 1.0
[UPDATE], 2231, 1.0
[UPDATE], 377087, 1.0